{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"fdcd396d-7fca-5fa2-aa64-ba26c68a0d9e","excerpt":"Recently, it seems that the only time I’ve spent with my blog has been moving it to other platforms. Hopefully, that will change with the move to Octopress…","html":"<p>Recently, it seems that the only time I’ve spent with my blog has been moving it to other platforms. Hopefully, that will change with the move to Octopress. Since this is mainly a programming / technical blog, I thought it would be great to host the blog with <a href=\"http://pages.github.com/\">Github pages</a>. </p>\n<p>The Octopress install was pretty simple.. I mostly just followed the steps on the <a href=\"http://octopress.org/docs/setup/\">Octopress Setup page</a>:</p>\n<ol>\n<li>Install Ruby / rbenv</li>\n<li>Install git </li>\n<li>Clone the Octopress repo</li>\n<li>Export posts from Wordpress</li>\n<li>Convert the Wordpress xml file to Jekyll with <a href=\"https://github.com/theaob/wpXml2Jekyll\">wpXml2Jekyll</a></li>\n<li>rake generate / rake deploy / git commit origin source (from the examples)</li>\n</ol>\n<p>The part that gave me the most trouble was hiding legacy posts from the main page area. I wanted to keep some of the posts around for posterity but I didn’t want them to show up with any sort of prominence on the blog. To that end, I created a folder called ‘Legacy’ and a folder within this newly created folder called ‘_posts’. From there, I moved the markdown versions of the posts into this folder. So far so good… </p>\n<p>When I fired up the preview for Octopress, the blog was still loading all the legacy posts in the content area. I asked a question on <a href=\"http://stackoverflow.com/questions/15852698/octopress-custom-folder-for-old-posts\">Stack Overflow</a> (that was subsequently shut down for not being programmy enough — whoops) and tried a couple other things until I stumbled upon <a href=\"http://arshad.github.io/blog/2012/05/10/recipe-hiding-posts-from-the-octopress-front-page/\">this post</a> on Hiding Pages from Octopress. Making the suggested changes produced the results I was looking for. Mission Accomplished — for now. I may try to change the ‘Recent Posts’ widget so it does not show legacy posts, however, that won’t be an issue when there is more content.</p>\n<p>So, as of this post, I’ve used all Octopress for all of one new article but I really like the workflow; storing the posts in github is definitely an added benefit. Hopefully, I will continue writing beyond this post but I guess we will see. </p>","frontmatter":{"title":"Moving to Octopress","date":"April 06, 2013","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog//2013-04-06-moving-to-octopress/","previous":null,"next":{"fields":{"slug":"/blog//2013-04-13-sublime-text-on-ubuntu/"},"frontmatter":{"title":"Sublime text on Ubuntu"}}}}