{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"c633b7b3-fd60-5681-a7e7-c358966bbdf2","excerpt":"I’ve been using  Gatsby  for quite some time on the  Griddle  documentation and really like it. I wanted to start writing more and thought a fresh start to the…","html":"<p>I’ve been using <a href=\"https://www.gatsbyjs.org/\">Gatsby</a> for quite some time on the <a href=\"http://griddlegriddle.github.io/Griddle\">Griddle</a> documentation and really like it. I wanted to start writing more and thought a fresh start to the blogging system I am using was in order.</p>\n<p>A couple of the reasons I’ve chosen to go with Gatsby (in no particular order):</p>\n<ol>\n<li><strong>It’s built with React</strong> - One of my main areas of focus right now is React development. This is a system that is familiar to me if I want to customize things.</li>\n<li><strong>It Uses Markdown</strong> - I can write my posts in markdown, and sync them with GitHub 👍</li>\n<li><strong>It builds a static site</strong> - I can run everything locally with <code class=\"language-text\">gatsby develop</code>. From there, once everything looks like it should, I can build and push the public directory to a specific git branch and my site is updated on GitHub pages.</li>\n<li><strong>Plugins</strong> - There are a number of plugins that extend the functionality of the application. </li>\n</ol>\n<p>There are a lot of great options for blogging and static site generation but <a href=\"https://www.gatsbyjs.org/\">Gatsby</a> is the one I’m using for now! </p>","frontmatter":{"title":"Blogging with gatsby","date":"August 12, 2017","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-08-12-gatsby/","previous":{"fields":{"slug":"/2016-11-17-setup-bash-on-windows-my-environment-configuration/"},"frontmatter":{"title":"Setup Bash on Windows: My environment configuration"}},"next":{"fields":{"slug":"/2017-08-13-gatsby-from-octopress/"},"frontmatter":{"title":"Migrating to Gatsby from Octopress"}}}}