{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"c54d1920-6307-50f1-86f6-d9eaf8ac9b72","excerpt":"Last fall, I won a Microsoft Surface 2 as part of the  Surface Remix Project contest . I always love to win gadgets but this was a bit more exciting to me as I…","html":"<p>Last fall, I won a Microsoft Surface 2 as part of the <a href=\"http://www.surfaceremixproject.com\">Surface Remix Project contest</a>. I always love to win gadgets but this was a bit more exciting to me as I am a hobby music producer (<a href=\"http://www.soundcloud.com/ryanlanciaux\">shameless link to some of my music</a>). I was initially planning on using the device for the music app/remix blade, however, after I had used the device a little over a week, I realized that there was a lot more to the Surface than just another device trying to make waves in the tablet market. I have since purchased a Surface Pro (1) and am really liking it. </p>\n<p>I want to be very clear here I’m stepping into a boundary that could make me sound very fanboy-ish. While I am generally a bit more fond of Microsoft technology than some (.NET developer by trade), I try to avoid using a gadget / language / whatever simply based on the brand. To put it another way, I am more of a fan of technology than any particular company — I like the advances that each competitor brings because overall it helps the consumer. </p>\n<p>Now that I said all that, I want to discuss my initial thoughts on what I think Microsoft is bringing to the table with the Surface and where I hope that’s going…</p>\n<h2>Hybrid OS</h2>\n<p>Initially upgrading to Windows 8 at home had resulted in me switching to Ubuntu until 8.1 came out. My reaction may have been a bit extreme, but I really was not a fan of how many aspects of the OS. While 8.1 is a ton better, seeing the operating system on the tablet really made Windows feel a bit more like it was likely intended. On my desktop I found myself using the Windows UI (or UI style formerly known as Metro) as a task launcher and using mostly desktop apps. On the Surface, however, I kind of wish I could turn desktop mode off entirely. That wouldn’t workout so well on the Pro, but it would be cool if that could be kind of a combination of the two — just Windows UI when no keyboard/dock is attached and more like the desktop when docked.</p>\n<p>I had always hoped that there would be a day when I would have one device that could function as my computer and phone (I guess kind of like the Ubuntu phone concept). While the Surface is not entirely where I would like this type of technology to end up, it is definitely a step in the right direction. As I said before, if it were entirely up to me, there would be some changes I would make to Windows 8 but it seems a step closer to making this a reality (still Windows phones would need to run the same OS — not just same kernel). </p>\n<h2>Niche Markets</h2>\n<p>As stated above, I won the Surface as part of a contest that Microsoft was having to promote their yet-to-be released Remix Cover. I think it’s fantastic that music producers are given a first-class experience in the Surface world. The remix blade feels like it’s a natural part of the Surface — not an add-on. I would love to see more things like this for the device.</p>\n<h2>Mobility</h2>\n<p>The weight of the Surface pales in comparison to any laptop I’ve ever owned — it’s almost an after-thought to pack it up and bring it when traveling. The type cover feels more natural to me than any iPad keyboard I’ve used and works well to protect the screen. </p>\n<p>Combined with a dock, such as the <a href=\"http://www.amazon.com/Plugable-UD-3900-Universal-2048x1152-Ethernet/dp/B00ECDM78E\">Plugable UD-3900</a>, I can run multiple monitors and hook up to a real keyboard / mouse. When I need to head out, I simply can unplug the dock from the USB port and use it as a tablet or laptop. </p>\n<h2>Processor</h2>\n<p>The Surface 2 felt pretty zippy but the fact that it ran Windows RT was a bit of a negative for me as a developer. The pro one has been fast enough so far for most web development tasks I’ve thrown at it. I wouldn’t necessarily play VM Inception with it but it’s worked out okay for me so far. I imagine the 2 with 8gb of RAM would fair even better.</p>\n<h2>Wrapping Up</h2>\n<p>I started this post in November — left it for a couple months and finally decided to finish it. My feelings toward the Surface are still the same. The pro seems like a fantastic developer machine (if you are in the windows realm) and the ability to have a specialized experience for niche applications makes it a great little device. </p>","frontmatter":{"title":"Thoughts on Microsoft Surface","date":"March 06, 2014","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog//2014-03-06--thoughts-on-microsoft-surface/","previous":{"fields":{"slug":"/blog//2013-10-10-fake-popovers-for-angular-xeditable/"},"frontmatter":{"title":"Fake popovers for Angular-xeditable"}},"next":{"fields":{"slug":"/blog//2014-05-13-vagrantfile-for-octopress/"},"frontmatter":{"title":"Vagrantfile for Octopress"}}}}