{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"22fc9e3f-b460-56f9-b454-89e2c407521b","excerpt":"My daughter is super ecstatic about Amazon Echo. When it came time to pick a Halloween Costume, she quickly decided an Amazon Echo is what she wanted to be. I…","html":"<p>My daughter is super ecstatic about Amazon Echo. When it came time to pick a Halloween Costume, she quickly decided an Amazon Echo is what she wanted to be. I was more than happy to help her see this interest come to fruition!</p>\n<p>I initially started down the path of building a <a href=\"https://github.com/alexa/alexa-avs-sample-app\">Raspberry Pi with AVS</a>. I soon realized that the Echo Dot would serve the same purpose and wouldn’t have the same potential debugging issues that I may run into building one on another computer :)</p>\n<p><a href=\"https://twitter.com/ryanlanciaux/status/922524085858590722\">See tweet with the finished costume</a> <br />\n<a href=\"https://twitter.com/ryanlanciaux/status/922524085858590722\">And tweet with a video of the costume in action</a></p>\n<h2>Supplies</h2>\n<ul>\n<li>Foam roll from craft store</li>\n<li>Metallic pen</li>\n<li>Scissors</li>\n<li>Cardboard</li>\n<li>Duct tape</li>\n<li>Adhesive velcro </li>\n<li>Drawstring backpack </li>\n<li>Lights</li>\n<li>Power source</li>\n<li>Echo Dot</li>\n<li>Power cords</li>\n<li>Portable speaker</li>\n</ul>\n<p>Once we had all the supplies, my wife and I cut the foam roll to size and attached adhesive Velcro in three places so our daughter could easily take the costume on and off. Next we cut arm holes and proceeded to freehand the Amazon logo at the bottom. For the ‘lid’ of the costume, we cut out a circle of foam and cardboard for the top, making sure there was plenty of room. Next we drew in the icons for the mute and action button.</p>\n<p>The lights are quite fickle, and we broke the first set bending it to tuck it into the costume. Being more careful with the next set, we gently removed the adhesive and attached them to the top border of the costume. We found that the electronics for the costume would fit nicely into a drawstring backpack over our daughter’s shoulders. Now all she had to do was step in with the backpack, Velcro up, and start talking to Alexa!</p>\n<p>The outcome is one happy, tech-savvy kiddo :D</p>\n<p><img src=\"./alaina_costume.jpg\" alt=\"Alexa costume\"></p>\n<p><a href=\"https://twitter.com/ryanlanciaux/status/922524085858590722\">See tweet with the finished costume</a> <br />\n<a href=\"https://twitter.com/ryanlanciaux/status/922524085858590722\">And tweet with a video of the costume in action</a></p>","frontmatter":{"title":"Amazon Echo Costume","date":"October 26, 2017","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-10-26-amazon-echo-costume/","previous":{"fields":{"slug":"/2017-08-20-a-feature-based-approach-to-react-development/"},"frontmatter":{"title":"A feature based approach to React development"}},"next":null}}