{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"eefc4996-7f99-51ef-b6ae-751044193b32","excerpt":"Software development, as an industry, has a constant struggle with shipping quality code. While many developers have metrics for what quality means, there’s a…","html":"<p>Software development, as an industry, has a constant struggle with shipping quality code. While many developers have metrics for what quality means, there’s a challenge in ensuring these metrics are met especially as a codebase grows over time.</p>\n<blockquote>\n<p>We build our computer systems the way we build our cities: over time, without a plan, and on top of ruins.</p>\n</blockquote>\n<div class=\"quoteCite\">- Ellen Ullman</div>\n<h2>Mise en place</h2>\n<p>While software development is a relatively young field, there are more established industries that we can learn from to help us write better code. For generations, chefs tout a mise en place mindset as a technique that is critical to success in the kitchen.</p>\n<blockquote>\n<p>The system that makes kitchens go is called mise-en-place, or, literally, “put in place.” It’s a French phrase that means to gather and arrange the ingredients and tools needed for cooking.</p>\n</blockquote>\n<div class=\"quoteCite\"><a href=\"https://www.npr.org/sections/thesalt/2014/08/11/338850091/for-a-more-ordered-life-organize-like-a-chef\">The Salt, NPR</a></div>\n<blockquote>\n<p>Mise en place refers to all of these various components that are prepared ahead of time and you have in place for that moment when you get the order and put the dish together.</p>\n</blockquote>\n<div class=\"quoteCite\"><a href=\"https://www.amazon.com/Every-Tools-Hammer-Life-What/dp/1982113472\">Adam Savage, Every Tool's a Hammer</a></div>","frontmatter":{"title":"The magic of a mise en place mindset for frontend development","date":"September 20, 2019","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/2019/09/20/the-magic-of-a-mise-en-place-mindset-for-frontend-development/","previous":{"fields":{"slug":"/blog/2019/09/16/windows-subsystem-for-linux-2/"},"frontmatter":{"title":"Windows Subsystem for Linux for JavaScript development"}},"next":null}}