{"data":{"site":{"siteMetadata":{"title":"Ryan Lanciaux","author":"Ryan Lanciaux"}},"markdownRemark":{"id":"d3593f78-3251-5a5d-a56c-65dd3291837e","excerpt":"I have been using git on most of my hobby projects for quite some time. I prefer the command line when possible, however, it is nice to visualize certain…","html":"<p>I have been using git on most of my hobby projects for quite some time. I prefer the command line when possible, however, it is nice to visualize certain operations. <a href=\"http://sourcetreeapp.com/\">SourceTree</a> and Github’s <a href=\"http://windows.github.com\">Windows</a> and <a href=\"http://mac.github.com\">Mac</a> apps are very nice but I’m mostly on Ubuntu when using git. <a href=\"https://www.kernel.org/pub/software/scm/git/docs/gitk.html\">Gitk</a> is a decent option but sometimes tools such as this and the aforementioned GUI tools can be a bit over-the-top for a command line junkie such as myself. Something between the command line and full blown windowed GUI applications would be great; this seems to be where <a href=\"http://jonas.nitro.dk/tig/\">tig</a> comes in.</p>\n<p><a href=\"http://jonas.nitro.dk/tig/\">Tig</a> has been around for a little while now but it just came across my radar via <a href=\"http://blogs.atlassian.com/2013/05/git-tig/\">an excellent post on Atlassian’s blog by Antoine Büsch</a> (as a side note, it’s kinda cool to see this post on Atlassian’s blog considering they make SourceTree). Antoine listed some compelling reasons for using tig but I was sold when he related tig to vim versus other development tools :)</p>\n<p>To install tig on Ubuntu just open up a command line and run the obvious <code class=\"language-text\">apt-get install tig</code>. From there, navigate to a directory under source control (with git) and type <code class=\"language-text\">tig</code> — you should see the main log view. Pressing ‘h’ will bring up help to see a list of available commands. You can stage changes by pressing ‘c’. For a more exhaustive list of commands, check out <a href=\"http://jonas.nitro.dk/tig/manual.html\">the official tig manual</a>.</p>","frontmatter":{"title":"Tig: Great git command line tool","date":"May 07, 2013","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog//2013-05-07-tig-great-git-command-line-tool/","previous":{"fields":{"slug":"/blog//2013-05-03-ikea-standing-desk/"},"frontmatter":{"title":"Ikea Standing Desk"}},"next":{"fields":{"slug":"/blog//2013-05-09-less-alt-plus-tab-with-sublimetext/"},"frontmatter":{"title":"Less alt+tab with SublimeText"}}}}